Revit 2027 API
ParameterTypeId.FabricationFittingDescription Property
 "Fabrication Fitting Description"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationFittingDescription { get; }
Public Shared ReadOnly Property FabricationFittingDescription As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationFittingDescription {
	ForgeTypeId^ get ();
}
static member FabricationFittingDescription : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace